//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: /Alaska/Tools/template.c 6     1/13/10 2:13p Felixp $
//
// $Revision: 6 $
//
// $Date: 1/13/10 2:13p $
//**********************************************************************
// Revision History
// ----------------
// $Log: /Alaska/Tools/template.c $
//
//**********************************************************************
//<AMI_FHDR_START>
//
// Name: RapidStartSetup.uni
//
// Description: Define String for RapidStart.
//
//<AMI_FHDR_END>
//**********************************************************************

/=#
#include "VFR.uni"

#string STR_RAPIDSTART_FORM                     #language eng "Intel(R) Rapid Start Technology"
#string STR_RAPIDSTART_FORM_HELP                #language eng "Intel(R) Rapid Start Technology."

#string STR_RAPIDSTART_SUBTITLE                 #language eng "Intel(R) Rapid Start Technology"

//---------------------------------------------------------------------------
// RAPIDSTART Configuration
//---------------------------------------------------------------------------
#string STR_ENABLED                             #language eng "Enabled"
#string STR_DISABLED                            #language eng "Disabled"
#string STR_EMPTY_STRING                        #language eng ""

#string STR_RAPIDSTART_SUPPORT_PROMPT           #language eng "Intel(R) Rapid Start Technology"
#string STR_RAPIDSTART_SUPPORT_HELP             #language eng "Enable or disable Intel(R) Rapid Start Technology."

#string STR_S3_RTC_WAKE_PROMPT                  #language eng "Entry on S3 RTC Wake"
#string STR_S3_RTC_WAKE_SUPPORT_HELP            #language eng "RapidStart invocation upon S3 RTC wake."

#string STR_S3_WAKE_TIMER_MIN_PROMPT            #language eng "  Entry After"
#string STR_S3_WAKE_TIMER_MIN_SUPPORT_HELP      #language eng "Enable RTC wake timer at S3 entry. Value range from 0(Immediately) to 120 minutes."

#string STR_CRIT_BATT_WAKE_PROMPT               #language eng "Entry on S3 Critical Battery Wake"
#string STR_CRIT_BATT_WAKE_HELP                 #language eng "RapidStart invocation upon critical battery wake."

#string STR_ACT_PAGE_SUPPORT_PROMPT             #language eng "Active Page Threshold Support"
#string STR_ACT_PAGE_SUPPORT_HELP               #language eng "Support RST with small partition."

#string STR_ACT_PAGE_SIZE_PROMPT                #language eng "Active Memory Threshold"
#string STR_ACT_PAGE_SIZE_HELP                  #language eng "Try to support RST when partition size > Active Page Threshold size in MB. When setting to zero, it will be in AUTO mode and check if partition size is enough at S3 entry."

#string STR_CRIT_BAT_WAK_THRHLD                 #language eng "  Critical battery wake threshold"
#string STR_CRIT_BAT_WAK_THRHLD_HELP            #language eng "Wake by critical battery event when battery capacity reached the threshold [0 - 100]."

#string STR_RAPIDSTART_PAR_STATUS_PROMPT        #language eng  "No valid partition"

#string STR_HYBRID_HARD_DISK_SUPPORT_PROMPT     #language eng "Hybrid Hard Disk Support"
#string STR_HYBRID_HARD_DISK_SUPPORT_HELP       #language eng "Hybrid Hard Disk Support"

#string STR_DISPLAY_SAVE_RESTORE_PROMPT         #language eng "RapidStart Display Save/Restore"
#string STR_DISPLAY_SAVE_RESTORE_HELP           #language eng "RapidStart Display Save/Restore"

#string STR_DISPLAY_TYPE_PROMPT                 #language eng "RapidStart Display Type"
#string STR_DISPLAY_TYPE_HELP                   #language eng "RapidStart Display Type"
#string STR_BIOS_SAVE_RESTORE_HELP              #language eng "BIOS Save/Restore"
#string STR_DESKTOP_SAVE_RESTORE_TYPE_HELP      #language eng "DeskTop Save/Restore"

#string STR_SATA_MODE_SELECTION_PROMPT          #language eng "SATA Mode Selection"
#string STR_SATA_MODE_SELECTION_HELP            #language eng "Determines how SATA controller(s) operate."
#string STR_SATA_IDE                            #language eng "IDE"
#string STR_SATA_AHCI                           #language eng "AHCI"
#string STR_SATA_RAID                           #language eng "RAID"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2012, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
